In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')
cur = con.cursor()
cur.executescript(open('van_crime_2003.sql', 'r').read())

In [5]:
df = pd.read_sql_query("SELECT TYPE, MONTH, DAY, NEIGHBOURHOOD FROM van_crimes WHERE NEIGHBOURHOOD IN ('Stanley Park', 'West End')", con=con, )
df.head()

                 TYPE  MONTH   DAY NEIGHBOURHOOD
0  Theft from Vehicle     12  30.0  Stanley Park
1  Theft from Vehicle     12  28.0  Stanley Park
2  Theft from Vehicle     12  12.0  Stanley Park
3  Theft from Vehicle     12  12.0  Stanley Park
4  Theft from Vehicle     11   5.0  Stanley Park

In [9]:
df.tail()

                                 TYPE  MONTH   DAY NEIGHBOURHOOD
59  Break and Enter Residential/Other      1  23.0      West End
60  Break and Enter Residential/Other      2   2.0      West End
61  Break and Enter Residential/Other      2  12.0      West End
62  Break and Enter Residential/Other      2  15.0      West End
63  Break and Enter Residential/Other      6  11.0      West End

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TYPE           64 non-null     object
 1   MONTH          64 non-null     int64
 2   DAY            64 non-null     float64
 3   NEIGHBOURHOOD  64 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 2.1+ KB

In [12]:
crime_types_count = df['TYPE'].count()
crime_types_count

64